{
    "Keys" : [],
    "ID" : "4",
    "ModelName": "[3 змінні]Модель Лоренца",
    "Expressions": 3,
    "Description" : "<p style=\"text-align: center;\">Модель Лоренца</p>
<p style=\"text-align: justify;\"><strong>Ди́вний атра́ктор Ло́ренца</strong> &mdash; атрактор, що демонструє хаотичну поведінку і є розв'язком системи трьох нелінійних диференціальних рівнянь, вперше записаний в 1963 році Едвардом Лоренцом при розгляді конвекційного руху в однорідному шарі рідини, що підігрівається знизу. Рівняння Лоренца також описують конвекцію в кільцевій трубці та поведінку одномодового лазера. Належить до класу так званих дивних атракторів. Варто зазначити, терміни хаос та дивний атрактор не вживалися в оригінальній роботі Лоренца (вони з'вилися в науковій літературі дещо пізніше), натомість йшлося про аперіодичні рухи.</p>
<br><img src=qrc:\/Lorenz-100.jpg><br>
<p style=\"text-align: justify;\">Варто вказати, що стосовно до задачі про конвекції модель Лоренца є дуже грубим наближенням, вельми далеким від реальності. Більш-менш адекватне відповідність існує в області регулярних режимів, де стійкі рішення якісно відображають експериментально спостережувану картину рівномірно обертаються конвективних валів (Осередки Бенара). Хаотичний режим, притаманний моделі, не описує турбулентної конвекції в силу істотної обрізки вихідних тригонометричних рядів.</p>
<p style=\"text-align: justify;\">Цікавим є істотно більша точність моделі при деякій її модифікації, що застосовується зокрема для опису конвекції в шарі, що піддається вібрації у вертикальному напрямку або змінному тепловому впливу. Такі зміни зовнішніх умов призводять до модулювання коефіцієнтів в рівняннях. При цьому високочастотні Фур'є-компоненти температури і швидкості істотно придушуються, покращуючи відповідність моделі Лоренца і реальної системи.</p>
<p style=\"text-align: justify;\">Примітно везіння Лоренца при виборі значення параметра <strong>r</strong>, так як система приходить до дивного аттрактору тільки при значеннях, більших 24,74, при менших поведінку виявляється зовсім іншим.</p>",
    "Data": {
        "InputAttributes" : [
            "X",
            "Y",
            "Z"
        ],
        "Coefs": [
            {
                "Name" : "Коеф. a",
                "Tip" : "Коеф 1",
                "Value" : "10",
                "Letter" : "a"
            },
            {
                "Name" : "Коеф. b",
                "Tip" : "Коеф 2",
                "Value" : "28",
                "Letter" : "b"
            },
            {
                "Name" : "Коеф. c",
                "Tip" : "Коеф 2",
                "Value" : "3",
                "Letter" : "c"
            }
        ],
        "RoleNames" : [
            "Динам. змінна X",
            "Динам. змінна Y",
            "Динам. змінна Z"
        ]
    }
}
