{
    "Keys" : [],
    "ID" : "1",
    "ModelName": "Модель Лотки-Вольтери",
    "Expressions": 2,
    "Description" : "<p> <b>Рівня́ння Ло́тки — Вольте́рри</b> або <b>рівня́ння хижа́к — же́ртва</b> — система двох звичайних диференціальних рівнянь першого порядку, яка описує кінетику чисельності популяції з одним типом хижаків і одним типом жертв. <br>Рівняння запропонували незалежно Альфред Джеймс Лотка та Віто Вольтерра, в 1925 та 1926 роках, відповідно.<br>Характерною особливістю рівннянь є те, що їхнім розв'язком є автоколивання.<br> У рівняння входять такі процеси: розмноження жертв та їхня гибель в результаті поїдання хижаками, розмноження та вимирання хижаків. Вважається, що розмноження хижаків пропорційне кількості іжі, тобто, кількості потенційних жертв у популяції. <br> Аналіз стійкості стаціонарних точок показує, що перша з них (нульова) є сідловою, а друга – фокусом. Показник Ляпунова для фокуса чисто уявний, тому з лінійного аналізу зробити висновок про стійкість чи нестійкість фокуса неможливо. Однак для рівнянь Лотка-Вольтерра існує інтеграл руху, який показує, що фазові траєкторії – замкнуті криві, всередині яких знаходиться фокус.</p>",
    "Data": {
        "InputAttributes" : [
            "Кількість жертв",
            "Кількість хижаків"
        ],
        "Coefs": [
            {
                "Name" : "Коеф. народж. жертв",
                "Tip" : "Коеф 1",
                "Value" : "2.0",
                "Letter" : "alp"
            },
            {
                "Name" : "Коеф. зустрічі ж-ви з хижаком",
                "Tip" : "Коеф 2",
                "Value" : "0.02",
                "Letter" : "beta"
            },
            {
                "Name" : "Коеф. народж. хижаків",
                "Tip" : "Коэф 3",
                "Value" : "0.01",
                "Letter" : "delt"
            },
            {
                "Name" : "Коеф. спаду хижаків",
                "Tip" : "Коэф 4",
                "Value" : "0.5",
                "Letter" : "gamma"
            }
        ],
        "RoleNames" : [
            "Жертви",
            "Хижаки"
        ]
    }
}
